#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gcs_api_extract.random_id.bucket_suffix: Refreshing state... [id=i_k]
module.flyte_gcs_backend.random_id.bucket_suffix: Refreshing state... [id=FsY]
random_password.flyte_db_password: Refreshing state... [id=none]
google_service_account.flyte_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_service.compute_api: Refreshing state... [id=exemplary-tide-379122/compute.googleapis.com]
google_project_service.container_api: Refreshing state... [id=exemplary-tide-379122/container.googleapis.com]
google_project_iam_custom_role.flyte_backend_role: Refreshing state... [id=projects/exemplary-tide-379122/roles/flyteBackendRole]
data.google_client_config.default: Reading...
google_service_account.user_code_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_service.composer_api: Refreshing state... [id=exemplary-tide-379122/composer.googleapis.com]
google_project_service.secret_mgr_api: Refreshing state... [id=exemplary-tide-379122/secretmanager.googleapis.com]
module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"]: Refreshing state... [id=pricing-aggregator-us-east1-spotify-web-api-extracts]
module.flyte_gcs_backend.google_storage_bucket.buckets["flyte-storage-backend"]: Refreshing state... [id=pricing-aggregator-us-east1-flyte-storage-backend]
data.google_client_config.default: Read complete after 1s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]
google_project_service.cloud_sql_api: Refreshing state... [id=exemplary-tide-379122/sqladmin.googleapis.com]
google_project_iam_member.user_code_role_member: Refreshing state... [id=exemplary-tide-379122/roles/editor/serviceAccount:user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_iam_binding.flyte_backend_role_binding: Refreshing state... [id=exemplary-tide-379122/projects/exemplary-tide-379122/roles/flyteBackendRole]
module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"]: Refreshing state... [id=b/pricing-aggregator-us-east1-spotify-web-api-extracts/roles/storage.objectAdmin]
module.flyte_gcs_backend.google_storage_bucket_iam_binding.admins["flyte-storage-backend"]: Refreshing state... [id=b/pricing-aggregator-us-east1-flyte-storage-backend/roles/storage.objectAdmin]
google_sql_database_instance.flyte_db_backend: Refreshing state... [id=flyte-db-backend]
google_container_cluster.flyte_binary_cluster: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-binary-cluster]
google_sql_user.flyte_db_user: Refreshing state... [id=postgres//flyte-db-backend]
google_container_node_pool.flyte_node_pool: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-binary-cluster/nodePools/flyte-np]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.flyte_binary_cluster must be replaced
-/+ resource "google_container_cluster" "flyte_binary_cluster" {
      ~ cluster_ipv4_cidr           = "10.100.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "34.138.191.220" -> (known after apply)
      ~ id                          = "projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-binary-cluster" -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.26.5-gke.1200" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                        = "flyte-binary-cluster"
      ~ network                     = "projects/exemplary-tide-379122/global/networks/default" -> "default"
      ~ networking_mode             = "ROUTES" -> (known after apply)
      ~ node_locations              = [] -> (known after apply)
      ~ node_version                = "1.26.5-gke.1200" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "exemplary-tide-379122" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/exemplary-tide-379122/zones/us-east1-b/clusters/flyte-binary-cluster" -> (known after apply)
      ~ services_ipv4_cidr          = "10.103.240.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/exemplary-tide-379122/regions/us-east1/subnetworks/default" -> (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)
        # (8 unchanged attributes hidden)

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      ~ master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRTy93djJZbGtLYlF5WDl1L3VGSGJEREFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSallqWmlPR0V5WVMxaE5qazFMVFF6WkRrdFlqUmhPUzAzTURKbFpEYzFZVFJpTUdNdwpJQmNOTWpNd056SXhNVGswTXpRd1doZ1BNakExTXpBM01UTXlNRFF6TkRCYU1DOHhMVEFyQmdOVkJBTVRKR05pCk5tSTRZVEpoTFdFMk9UVXRORE5rT1MxaU5HRTVMVGN3TW1Wa056VmhOR0l3WXpDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQU9EU1BpSUpqZmx3NnJZdTNFdDM4TXJRamJad01JQTlCdFlXL0tZNQpLTzZ4Q1ZVYkVnVEdYZ0pVZkwxeXVyWnFJM1RQNXF4djE1WTNTbThhbkpCOEZpMG96R01GQlBLMXYrZlFVaHgvCmorYlZIZUg2c2VuRjRYTFpUTWdpOTdNY09MV2txeFBNWlkzVENySGlKWkpLYlZsTTBkQm9NNFR3MTRnSEtvdTMKZ2hWb291SmFDUnhiTUl2cU1ML3cyeG5CT2FpR2VQL1hGMENpNnpoaWtOMDViSENOT3ZmSVFVMFJpbWQxb05rRApoUkhQWXRmWnhxK1h1dHNwd2Z4S29nbFF5Q0N0R2ZjTWErelJSaHR5ZjF5V1BMcEg1YWE3NjBWYkZWYjJkelhYCm96Rng3NU1Jd3JMelEvZEVFMGR3VDg4cGRmWHJGVlhXQlJlM3FkVHd5aFRxbEk2U3FkV2FVYUpkSzJBR1dURTgKVjJPS2lVaG11SnZmM21GYmgxd0Zmb1J5SkZGVHRzSGpWK2sxZlg0Y2VEWFkxS0pPRUdRaXN0Qm16dWVsRlQvUgpGN0ZrK1M5b29IMGx0TU1WQW1md3p2UjdGT29mNzJmckoxUkFRbWEvOFd5bm4xTVVyV005RFlwOXRrZjJXSkVZClVGMi9tRHJ2cStYV2c2TFhRZWZCNW8xNTh3SURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVVDS0dwRUowdDNtMW1PT2hod1VhWE0yaXdjckV3RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFIZmVhSFRQZEZBcUk5UmFhZWNOYmgzemVEVGpUQi9aL1FqT0EzdURYTlNaCnFWODhhMEhOR2VNTm0xVEdsa3dzSnU0M2dub0lyMXJKcDhERldrdGdOcUdPVnBmVHlIVGRtUnJPWGVsS0ZUcXMKdENwaExRN1VFN1RuOFhWMmNnWDRzaUVTT0JQWUkzSExGQjJYa25nU090RWhIbE9WYnp2NVJZQkxmK2xPYXJDNQpvbHEweXROWFVHSGxsSmphbUsrVlpQYlZvYTl3WDBzRlhGUmZrQUVyWEk5L1FIRjF2R3VyektQS3Z2dGZsTjBJCjdvY0JVcjFJbWlrT0xtRnRma0hweW1YODdNTk9TSnBTcVQ1N3g2MTB0bWNrdHlMRzdvU0kvY2lKbVNaVmlIK1MKd2tUaTF1dTRHRExsYjYzN0VZSWhyd0s4RTJqbUova0hWSVRrdTZXcGg0M2Z0Z0pkb1VKMXd3Qm1iTnhQdGZiegplSzQ0UkpIREVuVDA1Y2JBNHU4N2FQU3BjMituS0xuOG1rc21kaDAvOFkyWENCWFc1TFpnNjBEdnJ3NGh5S0JJCmlmN2tOdk5FS1hqVm5TRCt2Z0dsVEVUcktJM2QwdGlXRGlKbU1GUDNjSisxVHkwWHhSNmUremZMWFdINTBPSlAKRDJJYk1yU0s4TEpibzlPSXpsVWR3UT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

            # (1 unchanged block hidden)
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> 10 # forces replacement
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "e2-medium" -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> (known after apply)
          ~ preemptible       = true -> false # forces replacement
          - resource_labels   = {} -> null
          ~ service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [] -> (known after apply)
            # (3 unchanged attributes hidden)

          + ephemeral_storage_local_ssd_config { # forces replacement
              + local_ssd_count = 0 # forces replacement
            }

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - node_pool {
          - initial_node_count          = 2 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroupManagers/gke-flyte-binary-cluster-flyte-np-e722b000-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroups/gke-flyte-binary-cluster-flyte-np-e722b000-grp",
            ] -> null
          - max_pods_per_node           = 0 -> null
          - name                        = "flyte-np" -> null
          - node_count                  = 2 -> null
          - node_locations              = [
              - "us-east1-b",
            ] -> null
          - version                     = "1.26.5-gke.1200" -> null

          - autoscaling {
              - location_policy      = "ANY" -> null
              - max_node_count       = 4 -> null
              - min_node_count       = 2 -> null
              - total_max_node_count = 0 -> null
              - total_min_node_count = 0 -> null
            }

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - network_config {
              - create_pod_range     = false -> null
              - enable_private_nodes = false -> null
            }

          - node_config {
              - disk_size_gb      = 100 -> null
              - disk_type         = "pd-balanced" -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS_CONTAINERD" -> null
              - labels            = {} -> null
              - local_ssd_count   = 0 -> null
              - logging_variant   = "DEFAULT" -> null
              - machine_type      = "e2-medium" -> null
              - metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> null
              - preemptible       = true -> null
              - resource_labels   = {} -> null
              - service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
              - spot              = false -> null
              - tags              = [] -> null
              - taint             = [] -> null

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
              - strategy        = "SURGE" -> null
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.142.15.209" -> null
          - public_endpoint         = "34.138.191.220" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - security_posture_config {
          - mode               = "MODE_UNSPECIFIED" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }

        # (1 unchanged block hidden)
    }

  # helm_release.flyte_single_cluster will be created
  + resource "helm_release" "flyte_single_cluster" {
      + atomic                     = false
      + chart                      = "flyte-binary"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "flyte-test-setup"
      + namespace                  = "flyte"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.flyte.org"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.8.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*